<!-- attach-outputs:plan-nodes-test.txt -->
  <!-- Output: plan-nodes-test.txt -->
  #### plan-nodes-test.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 1, 2026, 05:36 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7411"
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.192.11",
            ],
        ]
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7411",
            ],
        ]
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "CE:5C:56:0A:86:14",
          - "E6:40:D8:5D:BF:33",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:74:11",
          + "bc:24:11:d0:74:11",
        ]
        name                                 = "tiles-test-cp"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ]
      ~ started                              = true -> false
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main has been deleted
  - resource "proxmox_virtual_environment_vm" "main" {
      - acpi                                 = true -> null
      - bios                                 = "seabios" -> null
      - boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> null
      - delete_unreferenced_disks_on_destroy = true -> null
      - description                          = "Worker - 7421 - tiles-test-wk - 10.0.192.21" -> null
      - id                                   = "7421" -> null
      - ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.192.21",
            ],
        ] -> null
      - ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7421",
            ],
        ] -> null
      - keyboard_layout                      = "en-us" -> null
      - mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "42:F7:9C:D4:D2:48",
          - "4E:CF:83:49:22:BB",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:74:21",
        ] -> null
      - migrate                              = false -> null
      - name                                 = "tiles-test-wk" -> null
      - network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ] -> null
      - node_name                            = "nuc-g3p-2" -> null
      - on_boot                              = true -> null
      - protection                           = false -> null
      - purge_on_destroy                     = true -> null
      - reboot                               = false -> null
      - reboot_after_update                  = true -> null
      - scsi_hardware                        = "virtio-scsi-single" -> null
      - started                              = true -> null
      - stop_on_destroy                      = false -> null
      - tablet_device                        = true -> null
      - tags                                 = [] -> null
      - template                             = false -> null
      - timeout_clone                        = 1800 -> null
      - timeout_create                       = 1800 -> null
      - timeout_migrate                      = 1800 -> null
      - timeout_move_disk                    = 1800 -> null
      - timeout_reboot                       = 1800 -> null
      - timeout_shutdown_vm                  = 1800 -> null
      - timeout_start_vm                     = 1800 -> null
      - timeout_stop_vm                      = 300 -> null
      - vm_id                                = 7421 -> null
        # (3 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cdrom {
          - enabled   = false -> null
          - file_id   = "local:iso/talos-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> null
          - interface = "ide2" -> null
        }

      - cpu {
          - cores        = 2 -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v3" -> null
          - units        = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-7421-disk-0" -> null
          - replicate         = true -> null
          - size              = 32 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

      - memory {
          - dedicated      = 8192 -> null
          - floating       = 8192 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = true -> null
          - mac_address  = "bc:24:11:d0:74:21" -> null
          - model        = "virtio" -> null
          - mtu          = 1 -> null
          - queues       = 16 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7411"
      ~ ipv4_addresses                       = [] -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
        name                                 = "tiles-test-cp"
      ~ network_interface_names              = [] -> (known after apply)
      ~ started                              = false -> true
        tags                                 = []
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Worker - 7421 - tiles-test-wk - 10.0.192.21"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-test-wk"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7421

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = "local:iso/talos-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso"
          + interface = "ide2"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 8192
          + floating       = 8192
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:74:21"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

  ```

  </details>
  
  